lib_app/app/controllers/libraries_controller.rb

INSERT INTO "libraries" ("name", "floor_count", "floor_area", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Hello Kitty"], ["floor_count", 999], ["floor_area", 999999], ["created_at", "2016-05-04 18:20:50.810667"], ["updated_at", "2016-05-04 18:20:50.810667"]]
---
  def create
    library_params = params.require(:library).permit(:name, :floor_count, :floor_area)
    @library = Library.create(library_params)

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @library = Library.find(params[:id])

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", nil]]
---
  def edit
    if current_user
      @library = Library.find(params[:library_id])

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", nil]]
UPDATE "libraries" SET "name" = $1, "floor_count" = $2, "floor_area" = $3, "updated_at" = $4 WHERE "libraries"."id" = $5  [["name", "Flying Squirrel Library"], ["floor_count", 294], ["floor_area", 24999], ["updated_at", "2016-05-05 00:00:28.435343"], ["id", 9]]
---
  def update
    @library = Library.find(params[:library_id])
    @library.update(library_params)

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "libraries" WHERE "libraries"."id" = $1  [["id", 1]]
---
  def destroy
    @library = Library.find(params[:library_id])
    if current_user
      @library.destroy