lib_app/app/controllers/library_books_controller.rb

  def index
    @library = Library.find(params[:library_id])
---
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 5]]

  def create
    @book = Book.create(book_params)
    @library = Library.find(params[:library_id])
---
INSERT INTO "books" ("title", "author", "releasedate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Killing them all"], ["author", "John Rusham"], ["releasedate", 2016], ["created_at", "2016-05-04 22:35:37.141212"], ["updated_at", "2016-05-04 22:35:37.141212"]]
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 7]]

  def show
    @library = Library.find(params[:library_id])
---
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 3]]

  def new
    @book = Book.new
    @library  =  Library.find(params[:library_id])
---
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 7]]

  def create
    @library = Library.find(params[:library_id])
    @book = Book.create(book_params)
    @library.books << @book
---
INSERT INTO "library_books" ("library_id", "book_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["library_id", 3], ["book_id", 6], ["created_at", "2016-05-04 22:38:27.479876"], ["updated_at", "2016-05-04 22:38:27.479876"]]

  def update
    @book = Book.find(params[:book_id])
    @book.update(book_params)
    @library = Library.find(params[:library_id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", 13]]
UPDATE "books" SET "title" = $1, "author" = $2, "releasedate" = $3, "updated_at" = $4 WHERE "books"."id" = $5  [["title", "Hello"], ["author", "im eric"], ["releasedate", 12345], ["updated_at", "2016-05-04 23:52:11.112052"], ["id", 13]]
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 9]]

  def edit
    @library = Library.find(params[:library_id])
    @book = Book.find(params[:book_id])
---
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 9]]
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", 13]]

  def destroy
    @library = Library.find(params[:library_id])
    if current_user
      @book = Book.find(params[:book_id])
      @library.books.destroy(@book)
---
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", 7]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 7]]
DELETE FROM "libraries" WHERE "libraries"."id" = $1  [["id", 3]]
DELETE FROM "library_books" WHERE "library_books"."id" = $1  [["id", 3]]