lib_app/app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @user = User.find_by_id(params[:id])
    if @user==current_user
      @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$h9ju1psMHRUmrbS.2gVpIujzRM1egWPVFE8woTRK8CIUgEfJlmN1C"], ["updated_at", "2016-05-03 21:44:31.428473"], ["id", 2]]